
** Load and validate data
SCHEDULED: <2023-12-06 Wed>
#+BEGIN_SRC python :session session_day_6 :results output
from pydantic import BaseModel
try:
  class Race(BaseModel):
    time: int
    distance: int

    def travelled(self,charge_time: int) -> int:
      return charge_time * (self.time - charge_time)
      
    
  class Data(BaseModel):
    races: list[Race]

  def load_data(test:bool) -> Data:
    if test:
      return Data(races=[Race(time=7,distance=9),Race(time=15, distance=40), Race(time=30,distance=200)])

    return Data(races=[Race(time=53,distance=275),Race(time=71,distance=1181),Race(time=78,distance=1215),Race(time=80,distance=1524)])

  data = load_data(True)
  print(data)
except Exception as e:
  print("Error:",e)
#+END_SRC

#+RESULTS:
: races=[Race(time=7, distance=9), Race(time=15, distance=40), Race(time=30, distance=200)]

